In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns 

from glob import glob 
file_name = glob('dataset/2022*.csv')

In [2]:
df_tmoney = pd.read_csv(file_name[0] )
df_tmoney

,사용월,노선ID,노선번호,노선명,버스정류장ID,버스정류장명,승차승객수,하차승객수,작업일시
0,2022-01,11110897,0017,0017번(청암동~이촌동),1,청암자이아파트,453,12,2022-02-03 08:49:57
1,2022-01,11110897,0017,0017번(청암동~이촌동),2,청암동강변삼성아파트,"1,328",43,2022-02-03 08:49:57
2,2022-01,11110897,0017,0017번(청암동~이촌동),3,청심경로당,"2,420",45,2022-02-03 08:49:57
3,2022-01,11110897,0017,0017번(청암동~이촌동),4,원효2동주민센터,"4,196",95,2022-02-03 08:49:57
4,2022-01,11110897,0017,0017번(청암동~이촌동),5,산천동,"5,255",206,2022-02-03 08:49:57
...,...,...,...,...,...,...,...,...,...
358603,2022-09,11110729,중랑02,중랑02(진로아파트~한신아파트),22,서일대정문,141,"6,056",2022-10-03 09:13:34
358604,2022-09,11110729,중랑02,중랑02(진로아파트~한신아파트),23,새마을금고,586,"5,616",2022-10-03 09:13:34
358605,2022-09,11110729,중랑02,중랑02(진로아파트~한신아파트),24,공판장,43,"7,038",2022-10-03 09:13:34
358606,2022-09,11110729,중랑02,중랑02(진로아파트~한신아파트),25,진주빌라.바다약국,29,"9,723",2022-10-03 09:13:34
358607,2022-09,11110729,중랑02,중랑02(진로아파트~한신아파트),26,진로아파트앞.종점,72,"3,003",2022-10-03 09:13:34

### 여기서 얻을 수 있는 인사이트는 ? 
- 가장 많이 이용하는 노선. 
- 월별 승*하차 이용 인원 비교

In [3]:
df_tmoney.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 358608 entries, 0 to 358607
Data columns (total 9 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   사용월      358608 non-null  object
 1   노선ID     358608 non-null  int64
 2   노선번호     358608 non-null  object
 3   노선명      358608 non-null  object
 4   버스정류장ID  358608 non-null  int64
 5   버스정류장명   358608 non-null  object
 6   승차승객수    358608 non-null  object
 7   하차승객수    358608 non-null  object
 8   작업일시     358608 non-null  object
dtypes: int64(2), object(7)
memory usage: 24.6+ MB

In [4]:
df_tmoney.isnull().mean()

사용월        0.0
노선ID       0.0
노선번호       0.0
노선명        0.0
버스정류장ID    0.0
버스정류장명     0.0
승차승객수      0.0
하차승객수      0.0
작업일시       0.0
dtype: float64

### 데이터 이상한거 수정 
- 노선 아이디 , 버스정류장 아이디 object형으로 수정 
- 승하차 승객 수 데이터 자료형 int로 수정
- 작업일시 컬럼 제거

In [5]:
df_tmoney['노선ID'] = df_tmoney['노선ID'].astype(str)
df_tmoney['버스정류장ID'] = df_tmoney['버스정류장ID'].astype(str)

In [6]:
df_tmoney['승차승객수'] = df_tmoney['승차승객수'].map(lambda x : int(x.replace(',',''))) 
df_tmoney['하차승객수'] = df_tmoney['하차승객수'].map(lambda x : int(x.replace(',','')))

In [7]:
del df_tmoney['작업일시']

In [8]:
df_tmoney.describe(include='object').T

          count unique                   top   freq
사용월      358608      9               2022-06  40537
노선ID     358608    653              11110369   1683
노선번호     358608    638                   N61   3366
노선명      358608    668  N61번(상계동차고지~양천공영차고지)   1683
버스정류장ID  358608    286                     6   5734
버스정류장명   358608   8209                 현대아파트    538

In [9]:
df_tmoney.describe().T

,count,mean,std,min,25%,50%,75%,max
승차승객수,358608.0,3198.674592,4410.625342,0.0,515.0,1886.0,4271.0,128371.0
하차승객수,358608.0,3125.771862,4007.381939,0.0,607.0,2024.0,4225.0,99788.0

In [10]:
df_tmoney[df_tmoney['승차승객수'] == df_tmoney['승차승객수'].max()]

,사용월,노선ID,노선번호,노선명,버스정류장ID,버스정류장명,승차승객수,하차승객수
352398,2022-09,11110537,관악02,관악02(낙성대역~서울대신공학관),26,노천강당,128371,99788

In [11]:
len(df_tmoney['버스정류장명'].unique())

8209

In [13]:
df_tmoney.shape

(358608, 8)